In [1]:
# PYTHON FOR DATA SCIENCE AND MACHINE LEARNING BOOTCAMP

# LINK FOR ALL MATERIAL ON GITHUB:
# https://github.com/JamesHizon/Python-for-Data-Science-and-Machine-Learning-Bootcamp

# Today's Lesson:

# 1) Groupby
# 2) Merging, Joining and Concatenating
# 3) Operations Sensation
# 4) Data Input and Output

# IMPORT PACKAGES:

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
# Groupby

# - Allows you to group together rows based off of a column and perform an aggregate function on them.

# Example: 

# Work with 2 Columns: ID and Value.

# - We want to partition them into 3 partitions: ID = 1, 2, and 3.

# - Then, we perform an aggregate function on them.

# DEF: Aggregate function:

# - where the values of multiple rows are grouped together as input on certain criteria

# - to form a single value of more significant meaning.

In [3]:
# Groupby with pandas!!!

# Create a dictionary:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [9]:
# STEP 1: Create Groupby object.

byComp = df.groupby('Company') # Will obtain a groupby object!

In [10]:
# STEP 2: Use ".mean()" to find mean of each company (observing the sales column).

byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [11]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [12]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [13]:
byComp.sum().loc['FB'] # Using ".loc['FB']" to find the sum of the company index: 'FB'.

Sales    593
Name: FB, dtype: int64

In [15]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [17]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [18]:
df.groupby('Company').describe() # Describe mean, std, min, 25/50/75% quartiles, and max.

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [23]:
df.groupby('Company').describe().transpose()['FB'] # Single column

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [25]:
# Merging, Joining and Concatenating:

df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [26]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [27]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [28]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [29]:
# DEF: Concatenation:

# - Basically glues together DataFrames.

# - Keep in mind, the dimensions should match along the axis you are concatenating on.

# - Can use pd.concat and pass in a list of DataFrames to concatenate together:

In [30]:
pd.concat([df1, df2, df3]) # Concatenate along rows.

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [32]:
pd.concat([df1,df2,df3], axis=1) 
# Concatenate along columns (NOTICE NULL VALUES b/c no information!)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [33]:
# EXAMPLE DataFrames:

left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [34]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [35]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [38]:
# OBSERVE: We want to first merge columns:

# DEF: Merging:

# - The merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together.

pd.merge(left, right, how='inner', on='key') # merges on same key column being shared.

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [42]:
# MORE Complicated Example:

left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

pd.merge(left, right, on=['key1', 'key2']) # Default: merge inner.

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [43]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [44]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [45]:
# DEF: Joining

# - A convenient method for combining the columns of two potentially differently-indexed DataFrames into
# a single result DataFrame.

left = pd.DataFrame({'A': ['A0', 'A1', 'A2'], # Column Titles (A, B)
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) # Row Titles

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [46]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [47]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [48]:
# Operations Sensation:

df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [49]:
# Finding unique values in a dataframe:

df['col2'].unique()

array([444, 555, 666])

In [50]:
# Number of unique values:

len(df['col2'].nunique())

3

In [52]:
# OR:

df['col2'].nunique()

3

In [53]:
# How many times a value occurs for each unique value:

df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [54]:
df[df['col1']>2]

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [55]:
df[df['col1']>2] # Running Dataframe with the given conditions

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [56]:
df['col1']>2 # Condition 1

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [59]:
df['col2']==444 # Condition 2

0     True
1    False
2    False
3     True
Name: col2, dtype: bool

In [61]:
# Combine Condition 1 AND Condition 2:

# Only Index 3 satisfies both conditions:

df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [62]:
# APPLY METHOD:

def times2(x):
    return x*2

In [67]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [66]:
# Use .apply() to broadcast each element into the function:

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [68]:
df['col3'].apply(len) # obtain length of each value in col3

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [70]:
# Lambda expressions for short functions:

df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [77]:
#df.drop('col1', axis=1, inplace=True)

KeyError: "['col1'] not found in axis"

In [79]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [80]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [81]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [85]:
# Sorting and Ordering a DataFrame:

# EXAMPLE: Sort by numerical order.
df.sort_values(by='col2')

# NOTICE: The index values stay the same.

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [86]:
# Find NULL Values in your dataframe:

# DataFrame of Booleans indicating if value is NULL or not:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [87]:
# Pivot Table (For advanced excel users):

data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [88]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [89]:
# QUESTION: What if, we want to make a multi-index table?

# Use the following:

df.pivot_table(values='D', index = ['A','B'], columns=['C'])

# INFO:

# - Main input arguments: values, index, columns.

# Docstring:

# - Create a spreadsheet-style pivot table as a DataFrame.

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [90]:
# HOW TO APPLY TO RAVATA-DATA?

# Maybe, let A = Voltage, B = Frequency.

In [ ]:
# DATA INPUT/OUTPUT:

# For reading csv, excel files, sql_tables, etc. I thought that it might not be needed to review yet.

# LINK:
# https://github.com/JamesHizon/Python-for-Data-Science-and-Machine-Learning-Bootcamp/blob/master/3.%20Pandas/Data%20Input%20and%20Output.ipynb

In [ ]:
# EXTRA INFO THAT MIGHT BE HELPFUL

# NUMPY:
# Uses:
# 1) Arrays
# 2) Indexing and Selection
# 3) Operations
# 4) Exercises

# LINK:
# https://github.com/JamesHizon/Python-for-Data-Science-and-Machine-Learning-Bootcamp/tree/master/2.%20NumPy

In [ ]:
# PANDAS DATA VIZ:

# Uses:
# 1) Built-in Data Viz (Different types of plots)
# 2) Exercises

# LINK:
# https://github.com/JamesHizon/Python-for-Data-Science-and-Machine-Learning-Bootcamp/tree/master/6.%20Pandas%20Built-in%20Data%20Viz

In [91]:
# MATPLOTLIB:

# LINK:
# https://github.com/JamesHizon/Python-for-Data-Science-and-Machine-Learning-Bootcamp/tree/master/4.%20Matplotlib